---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoofFacesLocation
source: html/63da575c-d605-26e5-4726-32975d2a3d03.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoofFacesLocation Property

"Picked Faces Location"

## Syntax (C#)
```csharp
public static ForgeTypeId RoofFacesLocation { get; }
```